console.log("Hello world");
// это комментарий на одной строке
/*
писанина комментария намного букав 
на нескольких строчках
TODO:Понять JavaScript

Типы данных
number(число)
5
V
-100
2.254
операторы для работы с number
+ оператор сложения
- вычитание
* умножение
/ деление 
** возведение в степень (2**4=>16)
(8**(1/3)=>2)
% остаток от деления (100%3=> 1)
унарные: + -

/** */

console.log((-5+40)*10);
//var x
let x;
x = 2;
let y = x**2;
const PI = 3.14;
age = 16;
age = age + 1;
age+=1;
y *=x;
console.log(y);